dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
#include <stdio.h>
#include "radio.h"
#include "stm32f7xx_hal.h"
#include "lr20xx.h"
#include "pinDefs_lr20xx.h"
#include "lr20xx_system.h"
#include "lr20xx_radio_common.h"
#include "lr20xx_radio_lora.h"
#include "lr20xx_radio_fifo.h"
#include "main.h" // for delay_ticks()
#ifdef ENABLE_HOPPING
#include "fhss.h"
#endif

/* Uncomment to enable TCXO instead of crystal oscillator */
// #define LR20XX_USE_TCXO
#ifdef LR20XX_USE_TCXO
#define LR20XX_TCXO_SUPPLY          LR20XX_SYSTEM_TCXO_CTRL_3_0V
#define LR20XX_TCXO_STARTUP_TICKS   300  /* 300 x 30.52µs = ~9.2ms */
#endif

/* LoRa sync word: 0x12 = Private Network, 0x34 = Public Network (LoRaWAN) */
#define LR20XX_LORA_SYNCWORD        0x12

static const RadioEvents_t* RadioEvents;

/* Static packet params - set by LoRaPacketConfig_lr20xx(), used by Send_lr20xx() */
static lr20xx_radio_lora_pkt_params_t lora_pkt_params;

/* Static modulation params - set by LoRaModemConfig_lr20xx(), used by is_bw_at_*(), is_sf_at_*() */
static lr20xx_radio_lora_mod_params_t lora_mod_params;

/* Streaming TX state - allows sending frames to FIFO incrementally */
volatile uint8_t tx_fifo_idx;        /* how much of tx_buf has been sent to FIFO */
volatile uint8_t tx_total_size;      /* total packet size to transmit */
volatile uint8_t streaming_tx_active; /* flag: streaming TX in progress */
volatile uint8_t tx_buf_produced;    /* how much encoder has written to tx_buf */

/* Streaming TX state machine */
volatile stream_state_t stream_state = STREAM_IDLE;
volatile uint32_t stream_underflow_count = 0;

void Radio_txDoneBottom()
{
    uint8_t tx_continuing = 0;  /* Flag: did we start next TX immediately? */
    streaming_tx_active = 0;

    if (stream_state == STREAM_BUFFERING_NEXT) {
        /* We were buffering next packet while this TX was in progress.
         * Check if we have enough frames to start next TX immediately. */
        uint8_t initial_bytes = get_streaming_initial_bytes();
        if (tx_buf_produced >= initial_bytes) {
            /* Enough frames ready - start TX immediately (no gap!) */
            extern uint8_t lora_payload_length;
            if (Send_lr20xx_streaming(lora_payload_length, initial_bytes) == 0) {
                stream_state = STREAM_TX_ACTIVE;
                tx_continuing = 1;  /* Don't notify app - we're still transmitting */
            } else {
                stream_state = STREAM_IDLE;
            }
        } else {
            /* Not enough frames yet - continue encoding */
            stream_state = STREAM_ENCODING;
        }
    } else if (stream_state == STREAM_WAIT_TX) {
        /* Normal completion: all frames were encoded before TX finished */
        stream_state = STREAM_IDLE;
    } else if (stream_state == STREAM_TX_ACTIVE) {
        /* Underflow: TX completed before all frames were encoded */
        stream_underflow_count++;
        stream_state = STREAM_IDLE;
        printf("\e[31mTX underflow #%lu\e[0m\r\n", stream_underflow_count);
    }
    /* Note: if state is STREAM_IDLE or STREAM_ENCODING, something is wrong
     * but we leave state as-is to avoid further confusion */

    /* Only notify app of TxDone if we're not continuing with next packet */
    if (!tx_continuing && RadioEvents->TxDone_botHalf)
        RadioEvents->TxDone_botHalf();

#ifdef ENABLE_HOPPING
    /* Handle FHSS continuous preamble TX */
    if (!tx_continuing)
        fhss_tx_done_handler();
#endif
}

void Radio_rx_done(uint8_t size, float rssi, float snr)
{
    RadioEvents->RxDone(size, rssi, snr);
}

void Radio_timeout_callback(bool tx)
{
    if (!tx) {
#ifdef ENABLE_HOPPING
        /* Check if FHSS is scanning - handle false CAD detection */
        fhss_timeout_handler();
#endif
        if (RadioEvents->RxTimeout)
            RadioEvents->RxTimeout();
#ifdef RX_INDICATION
        RX_INDICATION = 0;
#endif
    } // else TODO tx timeout
}

void Radio_chipModeChange()
{
    /* indicate radio mode with LEDs, if desired */
}

void Radio_dio8_top_half()
{
    if (RadioEvents->DioPin_top_half) {
        RadioEvents->DioPin_top_half();
	}

	// probably use lr20xx_stat_t stat.bits.chip_mode from lr20xx_hal.c to get chip mode, LR20XX_SYSTEM_CHIP_MODE_TX
	if (LR20xx_chipMode == LR20XX_SYSTEM_CHIP_MODE_TX) {
        /* TxDone handling requires low latency, but this could be other interrupt during TX such as fifo-irq */
        if (RadioEvents->TxDone_topHalf) {
            RadioEvents->TxDone_topHalf();
        } 
	}
}

static int lr20xx_hal_wait_on_busy( unsigned cnts )
{
	unsigned cnt = 0;
	while (BUSY) {
		delay_ticks(1);
		if (++cnt > cnts) {
			return -1;
		}
	}
	return 0;
}

static void Init_lr20xx(const RadioEvents_t* e)
{
	bool okay;

	// pin initializtion require prior to using reset pin
    init_lr20xx();

	printf("Init_lr20xx\r\n");
	do {
		printf("radio reset\r\n");
		lr20xx_system_reset(NULL);
		okay = lr20xx_hal_wait_on_busy(300) == 0;
		if (!okay) {
			printf("hw_reset busy stuck hi\r\n");
		}
	} while (!okay);
	printf("radio reset ok\r\n");

    LR20xx_txDone = Radio_txDoneBottom;
    LR20xx_rxDone = Radio_rx_done;
    LR20xx_timeout = Radio_timeout_callback;
    LR20xx_chipModeChange = Radio_chipModeChange;
    LR20xx_dio8_topHalf = Radio_dio8_top_half;
    lorahal.irqTopHalf = LR20xx_dio8_topHalf;
#ifdef ENABLE_HOPPING
    LR20xx_cadDone = fhss_cad_done_handler;
    LR20xx_preambleDetected = fhss_preamble_detected_handler;
#endif
 
    RadioEvents = e;

	/* After reset, the first command wakes the device but may not execute properly.
	 * Send GetVersion first as a wake-up command (will return v0.0), then
	 * configure regulator mode, then verify with another GetVersion. */
	{
		lr20xx_system_version_t version;
		lr20xx_system_get_version(NULL, &version);  /* wake-up command, ignore result */
	}

	/* Configure regulator mode to DC-DC for better power efficiency */
	ASSERT_LR20XX_RC( lr20xx_system_set_reg_mode(NULL, LR20XX_SYSTEM_REG_MODE_DCDC) );

	{
		lr20xx_status_t status;
		lr20xx_system_version_t version;
		delay_ticks(10);
		do {
			status = lr20xx_system_get_version(NULL, &version);
			if (status != LR20XX_STATUS_OK) {
				printf("get version fail\r\n");
				delay_ticks(50);
			} else if (version.major == 0 && version.minor == 0) {
				printf("version 0.0, unexpected\r\n");
				status = LR20XX_STATUS_ERROR;
				delay_ticks(10);
			}
		} while (status != LR20XX_STATUS_OK);
		printf("LR20xx v%u.%u\r\n", version.major, version.minor);
	}

#ifdef LR20XX_USE_TCXO
	/* Configure TCXO if enabled */
	ASSERT_LR20XX_RC( lr20xx_system_set_tcxo_mode(NULL, LR20XX_TCXO_SUPPLY, LR20XX_TCXO_STARTUP_TICKS) );
#endif

