dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
	/* Configure low frequency clock source (internal RC 32kHz) */
	ASSERT_LR20XX_RC( lr20xx_system_cfg_lfclk(NULL, LR20XX_SYSTEM_LFCLK_RC) );

	ASSERT_LR20XX_RC( lr20xx_radio_common_set_pkt_type(NULL, LR20XX_RADIO_COMMON_PKT_TYPE_LORA) );

	/* Set LoRa sync word */
	ASSERT_LR20XX_RC( lr20xx_radio_lora_set_syncword(NULL, LR20XX_LORA_SYNCWORD) );

	/* Initialize default LoRa packet params */
	lora_pkt_params.preamble_len_in_symb = 8;
	lora_pkt_params.pkt_mode = LR20XX_RADIO_LORA_PKT_EXPLICIT;
	lora_pkt_params.pld_len_in_bytes = 0;
	lora_pkt_params.crc = LR20XX_RADIO_LORA_CRC_ENABLED;
	lora_pkt_params.iq = LR20XX_RADIO_LORA_IQ_STANDARD;

	/* Configure PA for LF path (sub-GHz) */
	{
		lr20xx_radio_common_pa_cfg_t pa_cfg = {
			.pa_sel          = LR20XX_RADIO_COMMON_PA_SEL_LF,
			.pa_lf_mode      = LR20XX_RADIO_COMMON_PA_LF_MODE_FSM,
			.pa_lf_duty_cycle = 6,
			.pa_lf_slices     = 7,
			.pa_hf_duty_cycle = 16,  // unused for LF, but set to default
		};
		ASSERT_LR20XX_RC( lr20xx_radio_common_set_pa_cfg(NULL, &pa_cfg) );
	}

	/* Configure RX path for LF with boost mode */
	ASSERT_LR20XX_RC( lr20xx_radio_common_set_rx_path(NULL, LR20XX_RADIO_COMMON_RX_PATH_LF,
	                                                   LR20XX_RADIO_COMMON_RX_PATH_BOOST_MODE_7) );

	/* Set fallback mode after TX/RX/CAD
	 * For frequency hopping, use FS mode for faster CAD cycling
	 * FS keeps synthesizer running, avoiding XOSC restart delay */
#ifdef ENABLE_HOPPING
	ASSERT_LR20XX_RC( lr20xx_radio_common_set_rx_tx_fallback_mode(NULL, LR20XX_RADIO_FALLBACK_FS) );
#else
	ASSERT_LR20XX_RC( lr20xx_radio_common_set_rx_tx_fallback_mode(NULL, LR20XX_RADIO_FALLBACK_STDBY_RC) );
#endif

	/* Configure all DIO pins explicitly
	 * Options for dio_function:
	 *   LR20XX_SYSTEM_DIO_FUNC_NONE       - Not used
	 *   LR20XX_SYSTEM_DIO_FUNC_IRQ        - Interrupt output
	 *   LR20XX_SYSTEM_DIO_FUNC_RF_SWITCH  - RF switch control
	 *   LR20XX_SYSTEM_DIO_FUNC_GPIO_LOW   - GPIO output low
	 *   LR20XX_SYSTEM_DIO_FUNC_GPIO_HIGH  - GPIO output high
	 *   LR20XX_SYSTEM_DIO_FUNC_HF_CLK_OUT - HF clock output (DIO7-11 only)
	 *   LR20XX_SYSTEM_DIO_FUNC_LF_CLK_OUT - LF clock output (DIO7-11 only)
	 *   LR20XX_SYSTEM_DIO_FUNC_TX_TRIGGER - TX trigger input
	 *   LR20XX_SYSTEM_DIO_FUNC_RX_TRIGGER - RX trigger input
	 */
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_5,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_6,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_7,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_8,
	                                                  LR20XX_SYSTEM_DIO_FUNC_IRQ,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_9,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_10,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );
	ASSERT_LR20XX_RC( lr20xx_system_set_dio_function(NULL, LR20XX_SYSTEM_DIO_11,
	                                                  LR20XX_SYSTEM_DIO_FUNC_NONE,
	                                                  LR20XX_SYSTEM_DIO_DRIVE_NONE) );

	/* Clear any pending IRQs and configure IRQ mask for DIO8 */
	ASSERT_LR20XX_RC( lr20xx_system_clear_irq_status(NULL, LR20XX_SYSTEM_IRQ_ALL_MASK) );

	/* Enable TX done, RX done, timeout, error, and FIFO TX/RX interrupts on DIO8 */
	{
		lr20xx_system_irq_mask_t irq_mask = LR20XX_SYSTEM_IRQ_TX_DONE |
		                                    LR20XX_SYSTEM_IRQ_RX_DONE |
		                                    LR20XX_SYSTEM_IRQ_TIMEOUT |
		                                    LR20XX_SYSTEM_IRQ_ERROR |
		                                    LR20XX_SYSTEM_IRQ_FIFO_TX |
		                                    LR20XX_SYSTEM_IRQ_FIFO_RX;
#ifdef ENABLE_HOPPING
		/* Add CAD and preamble interrupts for frequency hopping sync */
		irq_mask |= LR20XX_SYSTEM_IRQ_CAD_DONE | LR20XX_SYSTEM_IRQ_CAD_DETECTED |
		            LR20XX_SYSTEM_IRQ_PREAMBLE_DETECTED;
#endif
		ASSERT_LR20XX_RC( lr20xx_system_set_dio_irq_cfg(NULL, LR20XX_SYSTEM_DIO_8, irq_mask) );
	}

	{
		lr20xx_system_version_t version;
		ASSERT_LR20XX_RC(lr20xx_system_get_version(NULL, &version));
		printf("Z LR20xx v%u.%u\r\n", version.major, version.minor);
	}
}

static void Standby_lr20xx()
{
	LR20xx_setStandby(LR20XX_SYSTEM_STANDBY_MODE_RC);
}

static void StandbyXosc_lr20xx()
{
	LR20xx_setStandby(LR20XX_SYSTEM_STANDBY_MODE_XOSC);
}

// from start_radio() at radio.c:
// 	* bwKhz is LORA_BW_KHZ
// 	* sf is sf_at_500KHz
// 	* cr is passed 1
static void LoRaModemConfig_lr20xx(unsigned bwKHz, uint8_t sf, uint8_t cr)
{
	lora_mod_params.cr = cr;  // 1 is LR20XX_RADIO_LORA_CR_4_5
	lora_mod_params.sf = sf;  // LR20XX_RADIO_LORA_SF5 is 5, LR20XX_RADIO_LORA_SF12 is 12

	/* Map requested kHz to nearest LR20xx bandwidth */
	if (bwKHz >= 1000) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_1000;
	} else if (bwKHz >= 812) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_812;
	} else if (bwKHz >= 500) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_500;
	} else if (bwKHz >= 406) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_406;
	} else if (bwKHz >= 250) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_250;
	} else if (bwKHz >= 203) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_203;
	} else if (bwKHz >= 125) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_125;
	} else if (bwKHz >= 101) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_101;
	} else if (bwKHz >= 83) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_83;
	} else if (bwKHz >= 62) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_62;
	} else if (bwKHz >= 41) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_41;
	} else if (bwKHz >= 31) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_31;
	} else if (bwKHz >= 20) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_20;
	} else if (bwKHz >= 15) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_15;
	} else if (bwKHz >= 10) {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_10;
	} else {
		lora_mod_params.bw = LR20XX_RADIO_LORA_BW_7;
	}

	lora_mod_params.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(lora_mod_params.sf, lora_mod_params.bw);

	ASSERT_LR20XX_RC( lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params) );
}

