dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
/* Calibration delta threshold in Hz (50 MHz) */
#define LR20XX_CALIBRATION_DELTA_HZ    50000000

static uint32_t last_calibrated_freq_hz = 0;
static uint32_t current_rf_freq_hz = 0;

void SetChannel_lr20xx(unsigned hz)
{
	current_rf_freq_hz = hz;
	ASSERT_LR20XX_RC( lr20xx_radio_common_set_rf_freq(NULL, hz) );

	/* Calibrate front end if frequency changed significantly */
	uint32_t freq_diff;
	if (hz > last_calibrated_freq_hz)
		freq_diff = hz - last_calibrated_freq_hz;
	else
		freq_diff = last_calibrated_freq_hz - hz;

	if (freq_diff >= LR20XX_CALIBRATION_DELTA_HZ || last_calibrated_freq_hz == 0) {
		lr20xx_radio_common_front_end_calibration_value_t calibration = {
			.frequency_in_hertz = hz,
			.rx_path = LR20XX_RADIO_COMMON_RX_PATH_LF,
		};
		ASSERT_LR20XX_RC( lr20xx_radio_common_calibrate_front_end_helper(NULL, &calibration, 1) );
		last_calibrated_freq_hz = hz;
	}
}

static void Rx_lr20xx(unsigned timeout_us)
{
	uint32_t timeout_rtc;

	if (timeout_us == 0) {
		/* Continuous RX mode */
		timeout_rtc = 0xFFFFFF;
	} else {
		/* Convert microseconds to RTC ticks (32.768 kHz = 30.52µs per tick) */
		timeout_rtc = (uint32_t)(((uint64_t)timeout_us * 32768) / 1000000);
		if (timeout_rtc > 0xFFFFFE) {
			timeout_rtc = 0xFFFFFE;  /* Max timeout ~511 seconds */
		}
	}

	LR20xx_chipMode = LR20XX_SYSTEM_CHIP_MODE_RX;
	ASSERT_LR20XX_RC( lr20xx_radio_common_set_rx_with_timeout_in_rtc_step(NULL, timeout_rtc) );
}

static void set_tx_dbm_lr20xx(int8_t dbm)
{
	/* For LR20XX_RADIO_COMMON_PA_SEL_LF: power range is -9.5dBm to +22dBm
	 * power_half_dbm = dbm * 2 (since power is in 0.5dBm steps)
	 * Clamp to valid range: 0xED (-9.5dBm) to 0x2C (+22dBm) */
	int8_t power_half_dbm = dbm * 2;
	if (power_half_dbm > 44)      // +22dBm max
		power_half_dbm = 44;
	if (power_half_dbm < -19)     // -9.5dBm min
		power_half_dbm = -19;

	ASSERT_LR20XX_RC( lr20xx_radio_common_set_tx_params(NULL, power_half_dbm, LR20XX_RADIO_COMMON_RAMP_48_US) );
}

int Send_lr20xx(uint8_t size/*, timestamp_t maxListenTime, timestamp_t channelFreeTime, int rssiThresh*/)
{
	/* Update payload length in stored packet params */
	lora_pkt_params.pld_len_in_bytes = size;

	if (lr20xx_radio_lora_set_packet_params( NULL, &lora_pkt_params ) != LR20XX_STATUS_OK)
		return -1;
	lr20xx_radio_fifo_clear_tx( NULL );
	if (lr20xx_radio_fifo_write_tx( NULL, LR20xx_tx_buf, size) != LR20XX_STATUS_OK)
		return -1;
	if (lr20xx_radio_common_set_tx(NULL, 0) != LR20XX_STATUS_OK)
		return -1;

	streaming_tx_active = 0;
	LR20xx_chipMode = LR20XX_SYSTEM_CHIP_MODE_TX;
	return 0;
}

/* Streaming TX: start transmitting with initial_bytes, remaining sent via FIFO interrupt */
int Send_lr20xx_streaming(uint8_t total_size, uint8_t initial_bytes)
{
	/* Update payload length in stored packet params */
	lora_pkt_params.pld_len_in_bytes = total_size;

	if (lr20xx_radio_lora_set_packet_params( NULL, &lora_pkt_params ) != LR20XX_STATUS_OK)
		return -1;
	lr20xx_radio_fifo_clear_tx( NULL );

	/* Write only initial bytes to FIFO */
	if (initial_bytes > total_size)
		initial_bytes = total_size;
	if (lr20xx_radio_fifo_write_tx( NULL, LR20xx_tx_buf, initial_bytes) != LR20XX_STATUS_OK)
		return -1;

	/* Set up streaming state */
	tx_fifo_idx = initial_bytes;
	tx_total_size = total_size;
	streaming_tx_active = 1;

	if (lr20xx_radio_common_set_tx(NULL, 0) != LR20XX_STATUS_OK)
		return -1;

	LR20xx_chipMode = LR20XX_SYSTEM_CHIP_MODE_TX;
	return 0;
}

/* Called from FIFO TX callback to send more data */
uint8_t Send_lr20xx_fifo_continue(void)
{
	uint8_t available;
	uint8_t to_send;

	/* Only send if in valid streaming state */
	if (stream_state != STREAM_TX_ACTIVE && stream_state != STREAM_WAIT_TX)
		return 0;

	if (!streaming_tx_active)
		return 0;

	/* Calculate how much data is available (produced but not yet sent to FIFO) */
	uint8_t produced = tx_buf_produced;
	if (produced > tx_total_size)
		produced = tx_total_size;

	if (produced <= tx_fifo_idx)
		return 0;  /* No new data available yet */

	available = produced - tx_fifo_idx;

	/* Send up to _bytes_per_frame at a time */
	extern uint8_t _bytes_per_frame;
	to_send = (available > _bytes_per_frame) ? _bytes_per_frame : available;

	if (lr20xx_radio_fifo_write_tx(NULL, &LR20xx_tx_buf[tx_fifo_idx], to_send) != LR20XX_STATUS_OK)
		return 0;

	tx_fifo_idx += to_send;
	return to_send;
}

static bool service_lr20xx()
{
    return LR20xx_service();
}

static void LoRaPacketConfig_lr20xx(unsigned preambleLen, bool fixLen, bool crcOn, bool invIQ)
{
	lora_pkt_params.preamble_len_in_symb = preambleLen;
	lora_pkt_params.pkt_mode = fixLen ? LR20XX_RADIO_LORA_PKT_IMPLICIT : LR20XX_RADIO_LORA_PKT_EXPLICIT;
	lora_pkt_params.crc = crcOn ? LR20XX_RADIO_LORA_CRC_ENABLED : LR20XX_RADIO_LORA_CRC_DISABLED;
	lora_pkt_params.iq = invIQ ? LR20XX_RADIO_LORA_IQ_INVERTED : LR20XX_RADIO_LORA_IQ_STANDARD;
	/* pld_len_in_bytes will be set by Send_lr20xx() */

	ASSERT_LR20XX_RC( lr20xx_radio_lora_set_packet_params(NULL, &lora_pkt_params) );
}

static void printOpMode_lr20xx()
{
	lr20xx_system_stat1_t stat1;
	lr20xx_system_stat2_t stat2;
	lr20xx_system_irq_mask_t irq_status;

	if (lr20xx_system_get_status(NULL, &stat1, &stat2, &irq_status) == LR20XX_STATUS_OK) {
		switch (stat2.chip_mode) {
			case LR20XX_SYSTEM_CHIP_MODE_SLEEP: printf("SLEEP "); break;
			case LR20XX_SYSTEM_CHIP_MODE_STBY_RC: printf("STBY_RC "); break;
			case LR20XX_SYSTEM_CHIP_MODE_STBY_XOSC: printf("STBY_XOSC "); break;
			case LR20XX_SYSTEM_CHIP_MODE_FS: printf("FS "); break;
			case LR20XX_SYSTEM_CHIP_MODE_RX: printf("RX "); break;
			case LR20XX_SYSTEM_CHIP_MODE_TX: printf("TX "); break;
			default: printf("?%d? ", stat2.chip_mode); break;
		}
	}
}

/* Bandwidth values in order from lowest to highest, with kHz values */
static const struct {
	lr20xx_radio_lora_bw_t bw;
	uint16_t khz;
} bw_table[] = {
	{ LR20XX_RADIO_LORA_BW_7,    8 },    /* 7.81 kHz */
	{ LR20XX_RADIO_LORA_BW_10,   10 },   /* 10.42 kHz */
	{ LR20XX_RADIO_LORA_BW_15,   16 },   /* 15.63 kHz */
	{ LR20XX_RADIO_LORA_BW_20,   21 },   /* 20.83 kHz */
	{ LR20XX_RADIO_LORA_BW_31,   31 },   /* 31.25 kHz */
	{ LR20XX_RADIO_LORA_BW_41,   42 },   /* 41.67 kHz */
	{ LR20XX_RADIO_LORA_BW_62,   63 },   /* 62.50 kHz */
	{ LR20XX_RADIO_LORA_BW_83,   83 },   /* 83.34 kHz */
	{ LR20XX_RADIO_LORA_BW_101,  102 },  /* 101.56 kHz */
	{ LR20XX_RADIO_LORA_BW_125,  125 },  /* 125 kHz */
	{ LR20XX_RADIO_LORA_BW_203,  203 },  /* 203 kHz */
	{ LR20XX_RADIO_LORA_BW_250,  250 },  /* 250 kHz */
	{ LR20XX_RADIO_LORA_BW_406,  406 },  /* 406 kHz */
	{ LR20XX_RADIO_LORA_BW_500,  500 },  /* 500 kHz */
	{ LR20XX_RADIO_LORA_BW_812,  812 },  /* 812 kHz */
	{ LR20XX_RADIO_LORA_BW_1000, 1000 }, /* 1000 kHz */
};
#define BW_TABLE_SIZE (sizeof(bw_table) / sizeof(bw_table[0]))

static bool is_bw_at_lowest(void)
{
	return lora_mod_params.bw == LR20XX_RADIO_LORA_BW_7;
}

static bool is_bw_at_highest(void)
{
	return lora_mod_params.bw == LR20XX_RADIO_LORA_BW_1000;
}

