dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
void step_bw_lr20xx(bool up)
{
	unsigned i;

	/* Find current position in table */
	for (i = 0; i < BW_TABLE_SIZE; i++) {
		if (bw_table[i].bw == lora_mod_params.bw)
			break;
	}

	if (i >= BW_TABLE_SIZE)
		return;  /* current bw not found */

	if (up) {
		if (i < BW_TABLE_SIZE - 1)
			i++;
	} else {
		if (i > 0)
			i--;
	}

	lora_mod_params.bw = bw_table[i].bw;
	lora_mod_params.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(lora_mod_params.sf, lora_mod_params.bw);
	ASSERT_LR20XX_RC( lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params) );
}

uint16_t get_bw_khz_lr20xx(void)
{
	for (unsigned i = 0; i < BW_TABLE_SIZE; i++) {
		if (bw_table[i].bw == lora_mod_params.bw)
			return bw_table[i].khz;
	}
	return 0;
}

uint8_t get_sf_lr20xx(void)
{
	return lora_mod_params.sf;
}

uint32_t get_freq_hz_lr20xx(void)
{
	return current_rf_freq_hz;
}

uint8_t get_chip_mode_lr20xx(void)
{
	lr20xx_system_stat1_t stat1;
	lr20xx_system_stat2_t stat2;
	lr20xx_system_irq_mask_t irq_status;

	if (lr20xx_system_get_status(NULL, &stat1, &stat2, &irq_status) == LR20XX_STATUS_OK) {
		return stat2.chip_mode;
	}
	return 0xff;  /* error */
}

static bool is_sf_at_slowest(void)
{
	return lora_mod_params.sf == LR20XX_RADIO_LORA_SF12;
}

static bool is_sf_at_fastest(void)
{
	return lora_mod_params.sf == LR20XX_RADIO_LORA_SF5;
}

void step_sf_lr20xx(bool up)
{
	if (up) {
		/* Higher SF = slower, more range */
		if (lora_mod_params.sf < LR20XX_RADIO_LORA_SF12)
			lora_mod_params.sf++;
	} else {
		/* Lower SF = faster */
		if (lora_mod_params.sf > LR20XX_RADIO_LORA_SF5)
			lora_mod_params.sf--;
	}

	lora_mod_params.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(lora_mod_params.sf, lora_mod_params.bw);
	ASSERT_LR20XX_RC( lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params) );
}

static void PostConfigReadBack()
{
	/* do nothing here, or save initial values */
}

void print_streaming_timing_analysis(void)
{
    extern uint8_t _bytes_per_frame;
    extern uint8_t lora_payload_length;
    extern uint8_t frames_per_sec;

    lr20xx_radio_lora_pkt_params_t pkt = lora_pkt_params;
    lr20xx_radio_lora_mod_params_t mod_test;
    uint32_t pkt_toa_ms;
    uint8_t frames_per_packet;
    uint32_t codec2_production_time;
    uint8_t codec2_frame_period_ms = 1000 / frames_per_sec;
    uint8_t max_sf;

    printf("\r\n=== Streaming Timing Analysis ===\r\n");
    printf("SF:%u BW:%ukHz frame_size:%u bytes\r\n",
           lora_mod_params.sf, get_bw_khz_lr20xx(), _bytes_per_frame);
    printf("Codec2 frame period: %u ms\r\n", codec2_frame_period_ms);

    /* Calculate packet timing */
    pkt.pld_len_in_bytes = lora_payload_length;
    pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
    frames_per_packet = lora_payload_length / _bytes_per_frame;
    codec2_production_time = frames_per_packet * codec2_frame_period_ms;

    printf("Packet: %u bytes = %u frames\r\n", lora_payload_length, frames_per_packet);
    printf("Packet time-on-air: %lu ms\r\n", pkt_toa_ms);
    printf("Codec2 production time for packet: %lu ms\r\n", codec2_production_time);

    if (pkt_toa_ms <= codec2_production_time) {
        printf("OK: Encoder keeps up (margin: %lu ms)\r\n",
               codec2_production_time - pkt_toa_ms);
    } else {
        printf("WARNING: packet_toa > production_time - buffer will drain!\r\n");
    }

    /* Calculate maximum usable SF */
    printf("\r\n--- SF Feasibility Analysis ---\r\n");
    mod_test = lora_mod_params;
    max_sf = lora_mod_params.sf;

    for (uint8_t sf = 5; sf <= 12; sf++) {
        uint32_t test_toa;
        mod_test.sf = sf;
        mod_test.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(sf, mod_test.bw);
        test_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &mod_test);

        if (test_toa <= codec2_production_time) {
            printf("SF%u: %lu ms - OK (margin %lu ms)\r\n",
                   sf, test_toa, codec2_production_time - test_toa);
            max_sf = sf;
        } else {
            printf("SF%u: %lu ms - TOO SLOW (exceeds by %lu ms)\r\n",
                   sf, test_toa, test_toa - codec2_production_time);
        }
    }

    printf("\r\nMaximum usable SF: %u (current: %u)\r\n", max_sf, lora_mod_params.sf);
    if (max_sf > lora_mod_params.sf) {
        printf("*** SF%u could be used for better range! ***\r\n", max_sf);
    }

    /* Calculate optimal packet size for SF12 */
    printf("\r\n--- SF12 Optimal Packet Size ---\r\n");
    mod_test.sf = 12;
    mod_test.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(12, mod_test.bw);

    uint8_t max_bytes_sf12 = 0;
    uint8_t max_frames_sf12 = 0;

    /* Search from largest to smallest to find max packet size for SF12 */
    for (uint8_t num_frames = 255 / _bytes_per_frame; num_frames >= 1; num_frames--) {
        uint8_t test_bytes = num_frames * _bytes_per_frame;
        uint32_t test_production = num_frames * codec2_frame_period_ms;
        uint32_t test_toa;

        pkt.pld_len_in_bytes = test_bytes;
        test_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &mod_test);

        if (test_toa <= test_production) {
            max_bytes_sf12 = test_bytes;
            max_frames_sf12 = num_frames;
            printf("SF12 max packet: %u bytes (%u frames)\r\n", max_bytes_sf12, max_frames_sf12);
            printf("  TOA: %lu ms, production: %lu ms, margin: %lu ms\r\n",
                   test_toa, test_production, test_production - test_toa);
            break;
        }
    }

    if (max_bytes_sf12 == 0) {
        printf("SF12: No viable packet size (even 1 frame is too slow)\r\n");
    } else if (max_bytes_sf12 < lora_payload_length) {
        printf("To use SF12: reduce lora_payload_length from %u to %u\r\n",
               lora_payload_length, max_bytes_sf12);
    }

    printf("=================================\r\n\r\n");
}

/* Adjust SF to optimize for streaming: reduce if margin too small, increase if room available.
 * Returns: 1 if SF was adjusted, 0 if no change needed, -1 if no feasible SF found */
/* Minimum margin (ms) between TOA and production time for reliable streaming.
 * This accounts for timing jitter in test mode frame generation. */
#define MIN_STREAMING_MARGIN_MS  10
#define MAX_SF  12

int adjust_sf_for_streaming(void)
{
    extern uint8_t _bytes_per_frame;
    extern uint8_t lora_payload_length;
    extern uint8_t frames_per_sec;

    lr20xx_radio_lora_pkt_params_t pkt = lora_pkt_params;
    lr20xx_radio_lora_mod_params_t test_mod = lora_mod_params;
    uint32_t pkt_toa_ms;
    uint8_t frames_per_packet;
    uint32_t codec2_production_time;
    uint8_t codec2_frame_period_ms = 1000 / frames_per_sec;
    uint8_t original_sf = lora_mod_params.sf;
    int32_t margin;

