dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
    /* Calculate current timing */
    pkt.pld_len_in_bytes = lora_payload_length;
    frames_per_packet = lora_payload_length / _bytes_per_frame;
    codec2_production_time = frames_per_packet * codec2_frame_period_ms;
    pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
    margin = (int32_t)codec2_production_time - (int32_t)pkt_toa_ms;

    /* Check if current SF is feasible with minimum margin */
    if (margin < MIN_STREAMING_MARGIN_MS) {
        /* SF too high or margin too small - need to reduce until feasible */
        printf("SF%u TOA=%lums margin=%ldms (min=%d), reducing SF...\r\n",
               lora_mod_params.sf, pkt_toa_ms, margin, MIN_STREAMING_MARGIN_MS);

        while (lora_mod_params.sf > 5) {
            lora_mod_params.sf--;
            lora_mod_params.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(
                lora_mod_params.sf, lora_mod_params.bw);
            pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
            margin = (int32_t)codec2_production_time - (int32_t)pkt_toa_ms;

            if (margin >= MIN_STREAMING_MARGIN_MS) {
                /* Found feasible SF with sufficient margin - apply it */
                ASSERT_LR20XX_RC(lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params));
                printf("Adjusted SF%u->SF%u (TOA=%lums, margin=%ldms)\r\n",
                       original_sf, lora_mod_params.sf, pkt_toa_ms, margin);
                return 1;  /* SF was adjusted */
            }
        }

        /* Even SF5 doesn't meet minimum margin - apply it anyway but warn */
        ASSERT_LR20XX_RC(lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params));
        printf("WARNING: SF5 margin=%ldms < min=%d\r\n", margin, MIN_STREAMING_MARGIN_MS);
        return -1;  /* No feasible SF found */
    }

    /* Current SF is feasible - try to increase SF for better range if possible */
    while (test_mod.sf < MAX_SF) {
        test_mod.sf++;
        test_mod.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(
            test_mod.sf, test_mod.bw);
        pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &test_mod);
        margin = (int32_t)codec2_production_time - (int32_t)pkt_toa_ms;

        if (margin < MIN_STREAMING_MARGIN_MS) {
            /* This SF is too slow - use the previous one */
            break;
        }
        /* This higher SF is still feasible - keep it as candidate */
        lora_mod_params.sf = test_mod.sf;
        lora_mod_params.ppm = test_mod.ppm;
    }

    if (lora_mod_params.sf != original_sf) {
        ASSERT_LR20XX_RC(lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params));
        pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
        margin = (int32_t)codec2_production_time - (int32_t)pkt_toa_ms;
        printf("Adjusted SF%u->SF%u (TOA=%lums, margin=%ldms)\r\n",
               original_sf, lora_mod_params.sf, pkt_toa_ms, margin);
        return 1;  /* SF was adjusted */
    }

    return 0;  /* No change needed */
}

/* Streaming TX configuration - type defined in radio.h */
streaming_config_t streaming_cfg;

/* Calculate streaming TX configuration based on timing analysis */
void calculate_streaming_config(void)
{
    extern uint8_t _bytes_per_frame;
    extern uint8_t lora_payload_length;
    extern uint8_t frames_per_sec;
    extern unsigned inter_pkt_timeout;

    lr20xx_radio_lora_pkt_params_t pkt = lora_pkt_params;
    lr20xx_radio_lora_mod_params_t mod_test;
    uint32_t pkt_toa_ms;
    uint32_t codec2_production_time;
    uint8_t codec2_frame_period_ms = 1000 / frames_per_sec;

    streaming_cfg.frames_per_packet = lora_payload_length / _bytes_per_frame;

    /* Calculate timing at current settings */
    pkt.pld_len_in_bytes = lora_payload_length;
    pkt_toa_ms = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
    codec2_production_time = streaming_cfg.frames_per_packet * codec2_frame_period_ms;
    streaming_cfg.margin_ms = (int32_t)codec2_production_time - (int32_t)pkt_toa_ms;

    if (streaming_cfg.margin_ms >= 0) {
        /* Check if pipelining is possible.
         * Pipelining works when we can encode the NEXT packet during CURRENT TX.
         * Time to encode next packet: frames_per_packet * frame_period (= codec2_production_time)
         * Time available during TX: pkt_toa
         * Pipelining works when: pkt_toa >= codec2_production_time
         */
        if (pkt_toa_ms >= codec2_production_time) {
            /* TX is slower than encoding - true streaming possible */
            streaming_cfg.streaming_feasible = 1;
            streaming_cfg.recommended_sf = lora_mod_params.sf;
            streaming_cfg.max_payload_bytes = lora_payload_length;
            /* We can encode all frames during TX, start with just 2 */
            streaming_cfg.min_initial_frames = 2;
        } else {
            /* TX is faster than encoding - pipelining won't work.
             * Need full packet buffer to avoid underflow.
             * This means gaps between packets are unavoidable. */
            streaming_cfg.streaming_feasible = 0;  /* Pipelining not feasible */
            streaming_cfg.recommended_sf = lora_mod_params.sf;
            streaming_cfg.max_payload_bytes = lora_payload_length;
            streaming_cfg.min_initial_frames = streaming_cfg.frames_per_packet;
            printf("NOTE: TX faster than encoding, buffering full packet\r\n");
        }
    } else {
        /* TX faster than encoder - need initial buffer or SF adjustment */
        streaming_cfg.streaming_feasible = 0;

        /* Find lowest SF that allows streaming */
        mod_test = lora_mod_params;
        for (uint8_t sf = 5; sf <= 12; sf++) {
            uint32_t test_toa;
            mod_test.sf = sf;
            mod_test.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(sf, mod_test.bw);
            test_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &mod_test);

            if (test_toa <= codec2_production_time) {
                streaming_cfg.recommended_sf = sf;
                streaming_cfg.streaming_feasible = 1;
                streaming_cfg.margin_ms = (int32_t)codec2_production_time - (int32_t)test_toa;
                break;
            }
        }

        if (!streaming_cfg.streaming_feasible) {
            /* Even SF5 too slow - need full buffer before TX */
            streaming_cfg.min_initial_frames = streaming_cfg.frames_per_packet;
            streaming_cfg.recommended_sf = 5;  /* fastest possible */
        } else {
            /* Found working SF - calculate min_initial_frames at recommended SF */
            mod_test.sf = streaming_cfg.recommended_sf;
            mod_test.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(mod_test.sf, mod_test.bw);
            uint32_t rec_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &mod_test);
            uint8_t frames_during_tx = rec_toa / codec2_frame_period_ms;
            if (frames_during_tx >= streaming_cfg.frames_per_packet)
                streaming_cfg.min_initial_frames = 2;  /* Can encode all frames during TX */
            else
                streaming_cfg.min_initial_frames = streaming_cfg.frames_per_packet - frames_during_tx;
        }

        streaming_cfg.max_payload_bytes = lora_payload_length;
    }

    /* If recommended SF differs from current SF and we're not going to change it,
     * recalculate min_initial_frames based on CURRENT SF to avoid underflow.
     * This handles the case where apply_streaming_sf() is not called. */
    if (streaming_cfg.recommended_sf != lora_mod_params.sf) {
        /* Current SF is different - recalculate min_initial_frames for actual SF */
        uint32_t actual_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
        uint32_t actual_production = streaming_cfg.frames_per_packet * codec2_frame_period_ms;

        if (actual_toa > actual_production) {
            /* Current SF is too slow for streaming - need full packet before TX */
            streaming_cfg.min_initial_frames = streaming_cfg.frames_per_packet;
            streaming_cfg.margin_ms = 0;  /* No margin - will buffer full packet */
            printf("WARNING: SF%u too slow for streaming, buffering full packet\r\n",
                   lora_mod_params.sf);
        } else {
            /* Calculate min_initial_frames for current SF using correct formula:
             * min_init = frames_per_packet - frames_during_tx */
            uint8_t frames_during_tx = actual_toa / codec2_frame_period_ms;
            if (frames_during_tx >= streaming_cfg.frames_per_packet)
                streaming_cfg.min_initial_frames = 2;  /* Can encode all frames during TX */
            else
                streaming_cfg.min_initial_frames = streaming_cfg.frames_per_packet - frames_during_tx;
            streaming_cfg.margin_ms = (int32_t)actual_production - (int32_t)actual_toa;
        }
    }

    /* Set inter-packet timeout based on margin + buffer.
     * This must be longer than the gap between packets to avoid false timeouts.
     * Gap between packets = margin_ms (when TX is faster than encoding).
     * Add pkt_toa/2 + 50ms for safety. */
    {
        uint32_t actual_toa = lr20xx_radio_lora_get_time_on_air_in_ms(&pkt, &lora_mod_params);
        uint32_t margin_abs = (streaming_cfg.margin_ms > 0) ? streaming_cfg.margin_ms : 0;
        inter_pkt_timeout = margin_abs + actual_toa / 2 + 50;
    }

