dudmuck/codec2_stm32f746g-discovery/lr20xx_hal/radio_lr20xx.c
    printf("Streaming config: feasible=%u, min_init=%u frames, rec_sf=%u, margin=%ld ms\r\n",
           streaming_cfg.streaming_feasible,
           streaming_cfg.min_initial_frames,
           streaming_cfg.recommended_sf,
           streaming_cfg.margin_ms);
}

/* Apply recommended SF for streaming (call on both TX and RX) */
uint8_t apply_streaming_sf(void)
{
    if (streaming_cfg.recommended_sf != lora_mod_params.sf) {
        printf("Adjusting SF from %u to %u for streaming\r\n",
               lora_mod_params.sf, streaming_cfg.recommended_sf);
        lora_mod_params.sf = streaming_cfg.recommended_sf;
        lora_mod_params.ppm = lr20xx_radio_lora_get_recommended_ppm_offset(
            lora_mod_params.sf, lora_mod_params.bw);
        ASSERT_LR20XX_RC( lr20xx_radio_lora_set_modulation_params(NULL, &lora_mod_params) );
    }
    return streaming_cfg.recommended_sf;
}

/* Get minimum initial bytes for streaming TX */
uint8_t get_streaming_initial_bytes(void)
{
    extern uint8_t _bytes_per_frame;
    return streaming_cfg.min_initial_frames * _bytes_per_frame;
}

void sethal_lr20xx()
{
    lorahal.init = Init_lr20xx;
    lorahal.standby = Standby_lr20xx;
    lorahal.standbyXosc = StandbyXosc_lr20xx;
    lorahal.loRaModemConfig = LoRaModemConfig_lr20xx;
    lorahal.setChannel = SetChannel_lr20xx;
    lorahal.set_tx_dbm = set_tx_dbm_lr20xx;
    lorahal.loRaPacketConfig = LoRaPacketConfig_lr20xx;
    lorahal.send = Send_lr20xx;
    lorahal.printOpMode = printOpMode_lr20xx;
    lorahal.service = service_lr20xx;
    lorahal.rx = Rx_lr20xx;
    lorahal.irqTopHalf = LR20xx_dio8_topHalf;
    lorahal.irq_pin = DIO8_PIN;
    lorahal.postcfgreadback = PostConfigReadBack;
    lorahal.bw_at_highest = is_bw_at_highest;
    lorahal.bw_at_lowest = is_bw_at_lowest;
    lorahal.sf_at_slowest = is_sf_at_slowest;
    lorahal.sf_at_fastest = is_sf_at_fastest;

    lorahal.rx_buf = LR20xx_rx_buf;
    lorahal.tx_buf = LR20xx_tx_buf;
}
